# Задача 10: На столе лежат n монеток. 
# Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, 
# чтобы все монетки были повернуты вверх одной и той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть
# ==============================================================
import random
def task1():
    n = int(input('Введите количество монет: '))
    face, back = 0, 0
    L = [random.randint(0,1) for i in range(n)]

    for i in L:
        if i == 0:
            face += 1
        else:
            back += 1
    if face >= back:
        print(f'Нужно перевернуть монет: {back}')
    else:
        print(f'Нужно перевернуть монет: {face}')

# Задача 12: Петя и Катя – брат и сестра. 
# Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. 
# Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. 
# Помогите Кате отгадать задуманные Петей числа.
# ==============================================================
def task2():
    x = int(input())
    y = int(input())
    for i in range(x):
        for j in range(y):
            if x == i + j and y == i * j:
                print(i, j)

# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
# ==============================================================
def task3():
    n = int(input())
    a = i = 0
    while 2**i <= n:
        print(2**i)
        i += 1
       
# task1()   
task2()
# task3()