# Задача 26: Напишите программу, которая на вход принимает
# два числа A и B, и возводит число А в целую степень B с
# помощью рекурсии.
# A = 3; B = 5 -> 243 (3⁵)
# A = 2; B = 3 -> 8
# ===========================================================

def pow_n(a, b):
    if b != 0:
        return pow_n(a, b-1)*a
    return 1    

A = int(input("Введите число А: "))
B = int(input("Введите степень В числа А: "))
A_pow_B = pow_n(A, B)
print(A_pow_B)

# ===========================================================
# Задача 28: Напишите рекурсивную функцию sum(a, b),
# возвращающую сумму двух целых неотрицательных чисел. Из
# всех арифметических операций допускаются только +1 и -1.
# Также нельзя использовать циклы.
# 2 2
# 4
# ===========================================================

def sum(a, b):
    if b == 0:
        return a
    return sum(a, b-1) + 1
a = int(input("Введите число А - "))
b = int(input("Введите число В - "))
print(sum(a, b))

# ===========================================================
